#### OpenTofu Plan 📝

<details><summary>Show Plan</summary>

```hcl

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # null_resource.validate_free_tier will be created
  + resource "null_resource" "validate_free_tier" {
      + id = (known after apply)
    }

  # oci_budget_alert_rule.alert_1_dollar will be created
  + resource "oci_budget_alert_rule" "alert_1_dollar" {
      + budget_id      = (known after apply)
      + defined_tags   = (known after apply)
      + description    = "Early warning - you've spent $1 this month"
      + display_name   = "Alert: $1 Spent (Early Warning)"
      + freeform_tags  = {
          + "alert-level" = "warning"
          + "cluster"     = "k3s"
          + "environment" = "homelab"
          + "managed-by"  = "terraform"
          + "threshold"   = "1-dollar"
          + "tier"        = "always-free"
        }
      + id             = (known after apply)
      + message        = <<-EOT
            ⚠️ OCI Billing Alert: $1 Threshold Reached
            
            Your Oracle Cloud spending has reached $1 this month.
            
            This is an early warning alert. Your free tier resources should be $0/month.
            If you're seeing charges:
            
            1. Check if you accidentally created non-free-tier resources
            2. Verify your ARM instances are using VM.Standard.A1.Flex shape
            3. Ensure you're within free tier limits (4 OCPUs, 24GB RAM)
            4. Review your OCI Console billing page
            
            Free tier resources this setup uses:
            - 1-3 ARM instances (VM.Standard.A1.Flex)
            - 4 OCPUs total, 24GB RAM total
            - 150GB Block Storage
            - All within Always Free limits
            
            Next alert: $5
        EOT
      + recipients     = "admin@sebv.dev"
      + state          = (known after apply)
      + threshold      = 1
      + threshold_type = "ABSOLUTE"
      + time_created   = (known after apply)
      + time_updated   = (known after apply)
      + type           = "ACTUAL"
      + version        = (known after apply)
    }

  # oci_budget_alert_rule.alert_5_dollars will be created
  + resource "oci_budget_alert_rule" "alert_5_dollars" {
      + budget_id      = (known after apply)
      + defined_tags   = (known after apply)
      + description    = "Urgent warning - you've spent $5 this month"
      + display_name   = "Alert: $5 Spent (URGENT)"
      + freeform_tags  = {
          + "alert-level" = "urgent"
          + "cluster"     = "k3s"
          + "environment" = "homelab"
          + "managed-by"  = "terraform"
          + "threshold"   = "5-dollars"
          + "tier"        = "always-free"
        }
      + id             = (known after apply)
      + message        = <<-EOT
            🚨 OCI Billing Alert: $5 THRESHOLD REACHED - URGENT
            
            Your Oracle Cloud spending has reached $5 this month!
            
            ACTION REQUIRED: Review your resources immediately.
            
            This infrastructure should be 100% free. If you're being charged:
            
            1. Log into OCI Console: https://cloud.oracle.com/
            2. Go to: Billing & Cost Management → Cost Analysis
            3. Identify what's causing charges
            4. Common issues:
               - Wrong instance shape (should be VM.Standard.A1.Flex)
               - Too many OCPUs (max 4 total for free tier)
               - Too much RAM (max 24GB total for free tier)
               - Additional block volumes beyond 200GB
               - Network egress over 10TB/month
            
            5. Consider destroying non-essential resources:
               cd seb-homelab-cloud
               tofu destroy
            
            Your configured setup:
            - Max 3 ARM instances (within 4 instance limit)
            - 4 OCPUs total (at limit)
            - 24GB RAM total (at limit)
            - 150GB storage (within 200GB limit)
            
            This should be $0/month.
        EOT
      + recipients     = "admin@sebv.dev"
      + state          = (known after apply)
      + threshold      = 5
      + threshold_type = "ABSOLUTE"
      + time_created   = (known after apply)
      + time_updated   = (known after apply)
      + type           = "ACTUAL"
      + version        = (known after apply)
    }

  # oci_budget_alert_rule.alert_forecast_90_percent will be created
  + resource "oci_budget_alert_rule" "alert_forecast_90_percent" {
      + budget_id      = (known after apply)
      + defined_tags   = (known after apply)
      + description    = "Forecasted spending will reach 90% of monthly budget"
      + display_name   = "Alert: Forecast 90% of Budget"
      + freeform_tags  = {
          + "alert-level" = "forecast"
          + "cluster"     = "k3s"
          + "environment" = "homelab"
          + "managed-by"  = "terraform"
          + "threshold"   = "90-percent"
          + "tier"        = "always-free"
        }
      + id             = (known after apply)
      + message        = <<-EOT
            📊 OCI Billing Forecast Alert
            
            Based on your current spending pattern, you're forecasted to reach
            90% of your $10 monthly budget ($9) by month end.
            
            This is unusual for free tier usage.
            
            Recommended actions:
            1. Review current spending in OCI Console
            2. Check for resources outside free tier
            3. Consider destroying test/unused resources
            
            Review billing: https://cloud.oracle.com/usage/reports
        EOT
      + recipients     = "admin@sebv.dev"
      + state          = (known after apply)
      + threshold      = 90
      + threshold_type = "PERCENTAGE"
      + time_created   = (known after apply)
      + time_updated   = (known after apply)
      + type           = "FORECAST"
      + version        = (known after apply)
    }

  # oci_budget_budget.free_tier_protection will be created
  + resource "oci_budget_budget" "free_tier_protection" {
      + actual_spend                          = (known after apply)
      + alert_rule_count                      = (known after apply)
      + amount                                = 10
      + budget_processing_period_start_offset = (known after apply)
      + compartment_id                        = "ocid1.tenancy.oc1..aaaaaaaauya6gand6lmc34totxwf7puiikejbih3dquyipsr22ldqe7g3hxa"
      + defined_tags                          = (known after apply)
      + description                           = "Protects against unexpected charges - alerts at $1 and $5"
      + display_name                          = "Free Tier Protection Budget"
      + end_date                              = (known after apply)
      + forecasted_spend                      = (known after apply)
      + freeform_tags                         = {
          + "environment" = "homelab"
          + "managed-by"  = "terraform"
          + "purpose"     = "cost-protection"
          + "tier"        = "always-free"
        }
      + id                                    = (known after apply)
      + processing_period_type                = (known after apply)
      + reset_period                          = "MONTHLY"
      + start_date                            = (known after apply)
      + state                                 = (known after apply)
      + target_compartment_id                 = (known after apply)
      + target_type                           = (known after apply)
      + targets                               = [
          + "ocid1.tenancy.oc1..aaaaaaaauya6gand6lmc34totxwf7puiikejbih3dquyipsr22ldqe7g3hxa",
        ]
      + time_created                          = (known after apply)
      + time_spend_computed                   = (known after apply)
      + time_updated                          = (known after apply)
      + version                               = (known after apply)
    }

  # oci_core_instance.k3s_control_plane will be created
  + resource "oci_core_instance" "k3s_control_plane" {
      + availability_domain                 = "JYNt:AP-SYDNEY-1-AD-1"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.tenancy.oc1..aaaaaaaauya6gand6lmc34totxwf7puiikejbih3dquyipsr22ldqe7g3hxa"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "k3s-control-1"
      + extended_metadata                   = (known after apply)
      + fault_domain                        = (known after apply)
      + freeform_tags                       = {
          + "cluster"     = "k3s"
          + "environment" = "homelab"
          + "managed-by"  = "terraform"
          + "role"        = "control-plane"
          + "tier"        = "always-free"
        }
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = (known after apply)
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + shape                               = "VM.Standard.A1.Flex"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + create_vnic_details {
          + assign_ipv6ip          = (known after apply)
          + assign_public_ip       = "true"
          + defined_tags           = (known after apply)
          + display_name           = "k3s-control-1-vnic"
          + freeform_tags          = (known after apply)
          + hostname_label         = (known after apply)
          + nsg_ids                = (known after apply)
          + private_ip             = (known after apply)
          + skip_source_dest_check = (known after apply)
          + subnet_id              = (known after apply)
          + vlan_id                = (known after apply)
        }

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = 12
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = 2
          + processor_description         = (known after apply)
          + vcpus                         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = "50"
          + boot_volume_vpus_per_gb = (known after apply)
          + source_id               = "ocid1.image.oc1.ap-sydney-1.aaaaaaaavd6pyh743377ohug5wxn77c2tomo3fh3hslna7dx5ktpk35llt7q"
          + source_type             = "image"
        }
    }

  # oci_core_internet_gateway.k3s_igw will be created
  + resource "oci_core_internet_gateway" "k3s_igw" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaauya6gand6lmc34totxwf7puiikejbih3dquyipsr22ldqe7g3hxa"
      + defined_tags   = (known after apply)
      + display_name   = "k3s-internet-gateway"
      + enabled        = true
      + freeform_tags  = {
          + "cluster"     = "k3s"
          + "environment" = "homelab"
          + "managed-by"  = "terraform"
          + "tier"        = "always-free"
        }
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_route_table.k3s_route_table will be created
  + resource "oci_core_route_table" "k3s_route_table" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaauya6gand6lmc34totxwf7puiikejbih3dquyipsr22ldqe7g3hxa"
      + defined_tags   = (known after apply)
      + display_name   = "k3s-route-table"
      + freeform_tags  = {
          + "cluster"     = "k3s"
          + "environment" = "homelab"
          + "managed-by"  = "terraform"
          + "tier"        = "always-free"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = (known after apply)
          + destination       = "0.0.0.0/0"
          + destination_type  = "CIDR_BLOCK"
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
    }

  # oci_core_security_list.k3s_security_list will be created
  + resource "oci_core_security_list" "k3s_security_list" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaauya6gand6lmc34totxwf7puiikejbih3dquyipsr22ldqe7g3hxa"
      + defined_tags   = (known after apply)
      + display_name   = "k3s-security-list"
      + freeform_tags  = {
          + "cluster"     = "k3s"
          + "environment" = "homelab"
          + "managed-by"  = "terraform"
          + "tier"        = "always-free"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + egress_security_rules {
          + description      = (known after apply)
          + destination      = "0.0.0.0/0"
          + destination_type = (known after apply)
          + protocol         = "all"
          + stateless        = false
        }

      + ingress_security_rules {
          + description = "HTTP"
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = (known after apply)
          + stateless   = false

          + tcp_options {
              + max = 80
              + min = 80
            }
        }
      + ingress_security_rules {
          + description = "HTTPS"
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = (known after apply)
          + stateless   = false

          + tcp_options {
              + max = 443
              + min = 443
            }
        }
      + ingress_security_rules {
          + description = "Internal cluster communication"
          + protocol    = "all"
          + source      = "10.0.0.0/16"
          + source_type = (known after apply)
          + stateless   = false
        }
      + ingress_security_rules {
          + description = "K8s API Server"
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = (known after apply)
          + stateless   = false

          + tcp_options {
              + max = 6443
              + min = 6443
            }
        }
      + ingress_security_rules {
          + description = "SSH access"
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = (known after apply)
          + stateless   = false

          + tcp_options {
              + max = 22
              + min = 22
            }
        }
    }

  # oci_core_subnet.k3s_subnet will be created
  + resource "oci_core_subnet" "k3s_subnet" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.0.1.0/24"
      + compartment_id             = "ocid1.tenancy.oc1..aaaaaaaauya6gand6lmc34totxwf7puiikejbih3dquyipsr22ldqe7g3hxa"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "k3s-subnet"
      + dns_label                  = "k3ssubnet"
      + freeform_tags              = {
          + "cluster"     = "k3s"
          + "environment" = "homelab"
          + "managed-by"  = "terraform"
          + "tier"        = "always-free"
        }
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = false
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # oci_core_vcn.k3s_vcn will be created
  + resource "oci_core_vcn" "k3s_vcn" {
      + byoipv6cidr_blocks               = (known after apply)
      + cidr_block                       = (known after apply)
      + cidr_blocks                      = [
          + "10.0.0.0/16",
        ]
      + compartment_id                   = "ocid1.tenancy.oc1..aaaaaaaauya6gand6lmc34totxwf7puiikejbih3dquyipsr22ldqe7g3hxa"
      + default_dhcp_options_id          = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_list_id         = (known after apply)
      + defined_tags                     = (known after apply)
      + display_name                     = "k3s-vcn"
      + dns_label                        = "k3svcn"
      + freeform_tags                    = {
          + "cluster"     = "k3s"
          + "environment" = "homelab"
          + "managed-by"  = "terraform"
          + "tier"        = "always-free"
        }
      + id                               = (known after apply)
      + ipv6cidr_blocks                  = (known after apply)
      + ipv6private_cidr_blocks          = (known after apply)
      + is_ipv6enabled                   = (known after apply)
      + is_oracle_gua_allocation_enabled = (known after apply)
      + state                            = (known after apply)
      + time_created                     = (known after apply)
      + vcn_domain_name                  = (known after apply)
    }

  # random_password.k3s_token will be created
  + resource "random_password" "k3s_token" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + all_nodes                    = {
      + k3s-control-1 = {
          + private_ip = (known after apply)
          + public_ip  = (known after apply)
          + role       = "control-plane"
        }
    }
  + budget_info                  = {
      + alert_thresholds = "$1, $5, and 90% forecast"
      + budget_id        = (known after apply)
      + monthly_budget   = "$10"
      + note             = "Free tier resources should cost $0/month"
      + recipients       = "admin@sebv.dev"
      + target           = "Entire tenancy"
    }
  + k3s_control_plane_private_ip = (known after apply)
  + k3s_control_plane_public_ip  = (known after apply)
  + k3s_token                    = (sensitive value)
  + k3s_worker_private_ips       = {}
  + k3s_worker_public_ips        = {}
  + kubeconfig_command           = (known after apply)
  + ssh_commands                 = {
      + k3s-control-1 = (known after apply)
    }
  + validation_summary           = {
      + instances  = "1/4"
      + memory_gb  = "12/24"
      + ocpus      = "2/4"
      + status     = "✅ Within Always-Free tier limits"
      + storage_gb = "50/200"
    }

```

</details>

*Pusher: @bazerama, Action: `pull_request`, Workflow: `OpenTofu CI/CD`*